#写函数，接收n个参数，求这些数的和



#找出传入的列表或元组的奇数位对应的元素，并返回一个新的列表



#写一个函数，判断用户传入的对象（不可哈希）长度是否大于5



#写一个函数，判断用户传入的列表长度是否大于2，如果大于2，只保留前两个，并将新内容返回给调用者



#写函数，统计字符串中有几个字母，几个数字，几个空格，几个其他字符，并返回结果



#写一个函数，判断用户传入的对象（字符串、列表、元组）的元素是否为空



#检查传入字典的每一个value长度，如果大于2，那么仅保留前两个长度的内容，并将新内容返回给调用者



#接收两个数字参数，返回比较大的数字



#写一个函数完成三次登陆功能，再写一个函数完成注册



#定义一个collatz函数，函数有一个number参数，判断number参数的值是偶数就打印number//2,是奇数就打印3*number+1



#定义一个cacluate函数，可以接收多个参数，返回元组类型的数据，第一个数是这些数的平均数，第二个数是大于平均数的数



#编写函数, 接收一个列表(包含10个整形数)和一个整形数k, 返回一个新列表.

    # 函数需求:
     #   - 将列表下标k之前对应(不包含k)的元素逆序;
      #  - 将下标k及之后的元素逆序;







#模拟轮盘抽奖游戏
'''
轮盘分为三部分: 一等奖, 二等奖和三等奖;
轮盘转的时候是随机的,
      如果范围在[0,0.08)之间,代表一等奖,
      如果范围在[0.08,0.3)之间,代表2等奖,
      如果范围在[0, 1.0)之间,代表3等奖,
模拟本次活动1000人参加, 模拟游戏时需要准备各等级奖品的个数.
'''
